diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
//Доработка Щукина Е.Д.
//Начало программный вывод на форму новых реквизитов договора, 
//если выбран вид договора "Абонентское обслуживание"

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ГруппаСрокДействия = ЭтаФорма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"),ЭтаФорма);
		ГруппаСрокДействия.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСрокДействия.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСрокДействия.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаСрокДействия.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_НачалоДействия", Тип("ПолеФормы"), ГруппаСрокДействия);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоДействия";
		НовыйЭлемент.Заголовок = "Начало действия договора";
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_ОкончаниеДействия", Тип("ПолеФормы"), ГруппаСрокДействия);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействия";
		НовыйЭлемент.Заголовок = "Окончание действия договора";
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Заголовок = "Сумма ежемесячной абоненсткой платы";
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		ВидДоговораПриИзмененииНаСервере()
	
	Иначе 
		
		//Элементы.ВКМ_НачалоДействия.Видимость = Ложь;
		//Элементы.ВКМ_ОкончаниеДействия.Видимость = Ложь;
		//Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		//Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
			
		ГруппаСрокДействия = ЭтотОбъект.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"),ЭтаФорма);
		ГруппаСрокДействия.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСрокДействия.Отображение = ОтображениеОбычнойГруппы.Нет;
		ГруппаСрокДействия.ОтображатьЗаголовок = ЛОЖЬ; 
		ГруппаСрокДействия.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_НачалоДействия", Тип("ПолеФормы"), ГруппаСрокДействия);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоДействия";
		НовыйЭлемент.Заголовок = "Начало действия договора";
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_ОкончаниеДействия", Тип("ПолеФормы"), ГруппаСрокДействия);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействия";
		НовыйЭлемент.Заголовок = "Окончание действия договора";
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Заголовок = "Сумма ежемесячной абоненсткой платы";
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";
	
КонецПроцедуры

//Доработка Щукина Е.Д.
//Конец программный вывод на форму новых реквизитов договора, 
//если выбран вид договора "Абонентское обслуживание"
